import json
from random import choice

cities = ['Аахен', 'Абу-Даби', 'Агадир', 'Агиос-Николаос', 'Аделаида', 'Аджман', 'Айя-Напа', 'Акаба', 'Акапулько',
          'Аккра', 'Аланья', 'Албена', 'Александрия', 'Алеппо', 'Алжир', 'Аликанте', 'Алма-Ата (Алматы)', 'Альмерия',
          'Амальфи', 'Амман', 'Амстердам', 'Андора-Ла-Велья', 'Анкара', 'Анкона', 'Анкоридж', 'Анталия', 'Антверпен',
          'Антиб', 'Ари атолл', 'Аринсал', 'Астана', 'Асуан', 'Атланта', 'Аугсбург', 'Афины', 'Ашдод', 'Ашкелон',
          'Ашхабад', 'Баа атолл', 'Багдад', 'Бад-Гаштайн', 'Бад-Хофгаштайн', 'Базель', 'Баку', 'Балчик', 'Бангалор',
          'Бангкок', 'Банско', 'Бар', 'Бари', 'Барселона', 'Бейрут', 'Белград', 'Белек', 'Белосток', 'Белфаст',
          'Бенидорм', 'Берген', 'Берлин', 'Берн', 'Бильбао', 'Бирмингем', 'Бишкек', 'Бланес', 'Богота', 'Бодрум',
          'Бока-Чика', 'Болонья', 'Бонн', 'Бордо', 'Боровец', 'Бостон', 'Бразилиа', 'Братислава', 'Брашов', 'Бремен',
          'Брест', 'Брисбен', 'Бристоль', 'Брно', 'Брюгге', 'Брюссель', 'Будапешт', 'Будва', 'Бургас', 'Бухарест',
          'Буэнос-Айрес', 'Валенсия', 'Валетта', 'Ванкувер', 'Варадеро', 'Варна', 'Варшава', 'Вашингтон', 'Веллингтон',
          'Вена', 'Венеция', 'Верона', 'Вильнюс', 'Виннипег', 'Висбаден', 'Вифлеем', 'Вроцлав', 'Вьентьян', 'Гаага',
          'Гавана', 'Гагра', 'Галле', 'Гамбург', 'Ганновер', 'Гданьск', 'Гдыня', 'Гент', 'Генуя', 'Герат', 'Гетеборг',
          'Глазго', 'Гоа', 'Гонконг', 'Гонолулу', 'Гранада', 'Гран-Канария', 'Грац', 'Гренобль', 'Гуантанамо',
          'Гуанчжоу', 'Гудаута', 'Гулрыпш', 'Даалу атолл', 'Давос', 'Дакка', 'Даламан', 'Далат', 'Далянь', 'Дамаск',
          'Дананг', 'Дар-эс-Салам', 'Дахаб', 'Дебрецен', 'Дели', 'Денпасар', 'Детройт', 'Джайпур', 'Джакарта', 'Джерба',
          'Джидда', 'Дидим', 'Днепропетровск', 'Донецк', 'Дортмунд', 'Доха', 'Дрезден', 'Дубай', 'Дублин', 'Дубровник',
          'Дуйсбург', 'Дурбан', 'Душанбе', 'Дюссельдорф', 'Елените', 'Ереван', 'Женева', 'Загреб', 'Задар', 'Закинтос',
          'Закопане', 'Зальбах-Хинтерглем', 'Зальцбург', 'Запорожье', 'Зеефельд', 'Зёльден', 'Золотые Пески', 'Ибица',
          'Иерусалим', 'Измир', 'Иматра', 'Инсбрук', 'Ираклион', 'Иркутск', 'Исламабад', 'Йокогама', 'Йоханнесбург', 'Кабул',
          'Кавала', 'Кадис', 'Каир', 'Калгари', 'Калифея', 'Калькутта', 'Кальяри', 'Канберра', 'Кандагар', 'Канкун',
          'Канны', 'Каппадокия', 'Капри', 'Каракас', 'Карачи', 'Карловы Вары', 'Карлсруэ', 'Касабланка', 'Катания',
          'Катманду', 'Катовице', 'Квебек', 'Кейптаун', 'Кельн', 'Кемер', 'Керкира', 'Киев', 'Кито', 'Китцбюэль',
          'Кишинев', 'Клагенфурт', 'Колимбия', 'Коломбо', 'Конаклы', 'Копенгаген', 'Корфу', 'Кос', 'Коста-Брава',
          'Коста-Дорада', 'Кота-Кинабалу', 'Котор', 'Кошице', 'Краби', 'Краков', 'Кранево', 'Кривой Рог',
          'Куала-Лумпур', 'Куопио', 'Куршавель', 'Кучинг', 'Кушадасы', 'Лавиани атолл', 'Лагос', 'Лангкави',
          'Лансароте', 'Ла-Пас', 'Ла-Пинеда', 'Ларнака', 'Лас-Вегас', 'Лас-Пальмас-де-Гран-Канария', 'Лассити', 'Лахти',
          'Лейпциг', 'Ленгенфельд', 'Ливерпуль', 'Ливорно', 'Лидс', 'Лилль', 'Лима', 'Лимассол', 'Линдос', 'Линц',
          'Лион', 'Лиссабон', 'Ллорет-де-Мар', 'Лодзь', 'Лозанна', 'Лондон', 'Лос-Анджелес', 'Луанда', 'Лугано',
          'Луганск', 'Луксор', 'Лутраки', 'Лхаса', 'Львов', 'Льеж', 'Любек', 'Люблин', 'Любляна', 'Люцерн', 'Маастрихт',
          'Мадрид', 'Майами', 'Майорка', 'Майрхофен', 'Макади Бей', 'Малага', 'Мале', 'Мальме', 'Манавгат', 'Манагуа',
          'Манаус', 'Манила', 'Манчестер', 'Марианские Лазни', 'Мармарис', 'Марса-Алам', 'Марсель', 'Маскат', 'Махдия',
          'Махмутлар', 'Медина', 'Мекка', 'Мельбурн', 'Мерида', 'Мессина', 'Мехико', 'Мешхед', 'Мииму атолл', 'Милан',
          'Минск', 'Мишкольц', 'Момбаса', 'Монастир', 'Монреаль', 'Монтевидео', 'Муйне', 'Мумбаи', 'Мурсия', 'Мюнстер',
          'Мюнхен', 'Назарет', 'Найроби', 'Нанкин', 'Нант', 'Нассау', 'Неаполь', 'Несебр', 'Нетания', 'Никосия',
          'Ницца', 'Нови-Сад', 'Новый Афон', 'Новый Орлеан', 'Нойштифт', 'Нувейба', 'Нью-Йорк', 'Нюрнберг', 'Нячанг',
          'Обзор', 'Одесса', 'Окленд', 'Оломоуц', 'Ольборг', 'Олюдениз', 'Ордино-Аркалис', 'Орлеан', 'Орхус', 'Осака',
          'Осло', 'Острава', 'Оттава', 'Оулу', 'Охрид', 'Очамчира', 'Падуя', 'Палермо', 'Пальма-де-Майорка',
          'Пампорово', 'Памуккале', 'Панама', 'Пардубице', 'Париж', 'Патры', 'Паттайя', 'Пафос', 'Пекин', 'Пелопоннес',
          'Пенанг', 'Перт', 'Пескара', 'Пиза', 'Пицунда', 'Плайя-дель-Кармен', 'Пловдив', 'Пльзень', 'Пномпень',
          'Подгорица', 'Познань', 'Поморие', 'Попрад', 'Порвоо', 'Пореч', 'Порту', 'Прага', 'Претория', 'Протарас',
          'Пула', 'Пунта-Кана', 'Пусан', 'Пуэрто-Плата', 'Пхеньян', 'Пхукет', 'Раа атолл', 'Рабат', 'Равда',
          'Регенсбург', 'Рейкьявик', 'Реймс', 'Ресифи', 'Ретимно', 'Рига', 'Риека', 'Рим', 'Римини', 'Рио-де-Жанейро',
          'Рованиеми', 'Родос', 'Росток', 'Роттердам', 'Салвадор', 'Салоники', 'Салоу', 'Самарканд', 'Сан-Диего',
          'Сан-Паулу', 'Сан-Ремо', 'Санта-Круз-де-Тенерифе', 'Санто-Доминго', 'Сантьяго', 'Сантьяго-де-Куба',
          'Сан-Франциско', 'Санья', 'Саппоро', 'Сарагоса', 'Сарыкамыш', 'Сассари', 'Сафага', 'Св. Константин и Елена',
          'Святой Влас', 'Себу', 'Севастополь', 'Севилья', 'Сегед', 'Сент-Этьен', 'Серфаус', 'Сеул', 'Сиануквиль',
          'Сиань', 'Сиде', 'Сидней', 'Сиемреап', 'Сиена', 'Сиину атолл', 'Сиракуза', 'Сиэтл', 'Скопье', 'Созополь',
          'Солнечный берег', 'Солнечный День', 'Сольдеу', 'Сома Бей', 'Сопот', 'Сорренто', 'София', 'Спарта', 'Сплит',
          'Ставангер', 'Стамбул', 'Стара-Загора', 'Стокгольм', 'Страсбург', 'Сува', 'Сусс', 'Сухум', 'Сфакс', 'Таба',
          'Тайбэй', 'Таллин', 'Тампере', 'Таранто', 'Таррагона', 'Ташкент', 'Тбилиси', 'Тебриз', 'Тегеран', 'Тель-Авив',
          'Тенерифе', 'Теплице', 'Тиват', 'Тирана', 'Токио', 'Томар', 'Торонто', 'Тgbiосса-де-Мар', 'Трабзон', 'Триест',
          'Тромсе', 'Тронхейм', 'Тулон', 'Тулуза', 'Тунис', 'Турин', 'Турку', 'Тяньцзинь', 'Улан-Батор', 'Урумчи',
          'Утрехт', 'Ухань', 'Фаафи атолл', 'Фалираки', 'Фамагуста', 'Фанес', 'Фантхьет', 'Фару', 'Фетхие',
          'Филадельфия', 'Флоренция', 'Фрайбург', 'Франкфурт-на-Майне', 'Фрипорт', 'Фуджейра', 'Фукусима', 'Фуншал',
          'Фуэртевентура', 'Хаа Алифу атолл', 'Хайфа', 'Хаммамет', 'Ханой', 'Ханья', 'Харбин', 'Харьков', 'Хевиз',
          'Хельсинки', 'Херсониссос', 'Хошимин', 'Хуа Хин', 'Хургада', 'Хьюстон', 'Хэйхэ', 'Цель-ам-Зее', 'Церматт',
          'Цюрих', 'Ченнаи', 'Чешме', 'Чиангмай', 'Чикаго', 'Чунцин', 'Шанхай', 'Шарджа', 'Шарм-эль-Шейх', 'Шеньжень',
          'Шеньян', 'Штутгарт', 'Щецин', 'Эдинбург', 'Эдмонтон', 'Эйлат', 'Эльблонг', 'Эль-Гуна', 'Эль-Пас-де-ла-Каса',
          'Эрзурум', 'Эр-Рияд', 'Ялиссос', 'Янгон', 'Яссы']


def cities_keyboard():
    keyboard = {
        "one_time": False,
        "buttons": [
            [{
                "action": {
                    "type": "text",
                    "payload": "{\"button\": \"3\"}",
                    "label": "Выход &#128682;"
                },
                "color": "negative"
            }, ]
        ]
    }
    keyboard = json.dumps(keyboard, ensure_ascii=False).encode('utf-8')
    keyboard = str(keyboard.decode('utf-8'))
    return keyboard


def bot_turn_cities(user_cities, last):
    if len(user_cities) == 550:
        city = choice(user_cities)
    else:
        city = choice(list(filter(lambda x: x[0].lower() == last, user_cities)))
    if city != '':
        del user_cities[user_cities.index(city)]
        if city[-1] == 'ь' or city[-1] == 'ъ' or city[-1] == 'ы':
            last = city[-2]
        else:
            last = city[-1]
        return [city, user_cities, last]


def human_turn_cities(msg, user_cities, last):
    if msg[0].lower() == last and msg in user_cities:
        del user_cities[user_cities.index(msg.capitalize())]
        if msg[-1] == 'ь' or msg[-1] == 'ъ' or msg[-1] == 'ы':
            last = msg[-2]
        else:
            last = msg[-1]
        return [True, user_cities, last]
    return [False, user_cities, last]